// js/items.js
// 持ち物データ（曜日 × 時間）

const items = {
  mon: {
    1: ["体育館シューズ"],
    2: ["英語ノート", "教科書"],
    3: ["PC"],
    4: ["数学ノート"],
    5: ["エプロン"],
    6: ["エプロン"],
    7: ["白衣"]
  },
  tue: {
    1: ["数学ノート"],
    2: ["体育館シューズ"],
    3: ["PC"],
    4: ["PC"],
    5: [],
    6: []
  },
  wed: {
    1: ["白衣"],
    2: ["地理ノート"],
    3: ["音楽ファイル"],
    4: ["画材"],
    5: ["英語ノート"],
    6: ["体育館シューズ"]
  },
  thu: {
    1: ["英語ノート"],
    2: ["実習道具"],
    3: ["PC"],
    4: ["作業着"],
    5: ["作業着"],
    6: ["作業着"]
  },
  fri: {
    1: ["PC"],
    2: ["実習道具"],
    3: ["地理ノート"],
    4: ["数学ノート"],
    5: ["PC"],
    6: ["PC"]
  }
};
