// js/rooms.js
// 教室データ（曜日 × 時間）

const rooms = {
  mon: {
    1: "体育館",
    2: "3-1",
    3: "PC室",
    4: "2-2",
    5: "家庭科室",
    6: "家庭科室",
    7: "理科室"
  },
  tue: {
    1: "2-2",
    2: "体育館",
    3: "PC室",
    4: "PC室",
    5: "HR教室",
    6: "HR教室"
  },
  wed: {
    1: "理科室",
    2: "3-2",
    3: "音楽室",
    4: "美術室",
    5: "3-1",
    6: "体育館"
  },
  thu: {
    1: "3-1",
    2: "電気実習室",
    3: "PC室",
    4: "工業実習室",
    5: "工業実習室",
    6: "工業実習室"
  },
  fri: {
    1: "PC室",
    2: "電気実習室",
    3: "3-2",
    4: "2-2",
    5: "PC室",
    6: "PC室"
  }
};
